#include <stdio.h>

int main(void)
{
	int num;
	int hour=0;
	int min=0;
	int second=0;
	
	scanf("%d", &num); //ÃÊ ÀÔ·Â ¹ŞÀ½
	
	while(1)
	{	
		if(num-3600>0) //num¿¡¼­ 3600À» »°´Âµ¥ 0º¸´Ù Å©´Ù¸é ½Ã°£ ´ÜÀ§°¡ ³²¾ÆÀÖ´Ù´Â ¶æÀÌ¹Ç·Î ...
		{
			num-=3600; //3600À» »©¼­ num¿¡ ÀúÀåÇÏ°í ...
			hour++; //hour°ªÀ» ÇÏ³ª Áõ°¡½ÃÅ´ 
		}
		else //num¿¡¼­ 3600À» »°´Âµ¥ 0ÀÌÇÏ¸é ½Ã°£ ´ÜÀ§°¡ ´õÀÌ»ó ³²¾ÆÀÖÁö ¾Ê´Ù´Â ¶æÀÌ¹Ç·Î ...
			break; //¹İº¹¹®À» Å»ÃâÇÑ´Ù 
	}

	while(1)
	{
		if(num-60>0) //num¿¡¼­ 60À» »°´Âµ¥ 0º¸´Ù Å©´Ù¸é ºĞ ´ÜÀ§°¡ ³²¾ÆÀÖ´Ù´Â ¶æÀÌ¹Ç·Î ...
		{
			num-=60; //60À» »©¼­ num¿¡ ÀúÀåÇÏ°í ... 
			min++; //min°ªÀ» ÇÏ³ª Áõ°¡½ÃÅ´ 
		}
		else //num¿¡¼­ 60À» »°´Âµ¥ 0ÀÌÇÏ¸é ºĞ ´ÜÀ§°¡ ´õÀÌ»ó ³²¾ÆÀÖÁö ¾Ê´Ù´Â ¶æÀÌ¹Ç·Î ... 
			break; //¹İº¹¹®À» Å»­„ÇÑ´Ù 
	}

	second=num;
	
	printf("h: %d, m: %d, s: %d", hour, min, second);
	
	return 0;
}
	
	
	
	
	
	
